jmeter/210_X12_Localhost_8081_2_5_1_and_3_0_0.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan Localhost X12 2.5.1/3.0.0" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="50 Threads" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">25</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">30</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="2.5.1 HTTP POST X12 004010/210 Localhost Reques " enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">ISA*00*          *00*          *ZZ*MELERA         *ZZ*MULE           *190626*1830*U*00400*000003507*1*P*&gt;&#xd;
GS*IM*MELERA*MULE*20190626*1830*3507*X*004010&#xd;
ST*210*0001&#xd;
B3**12121231*ABC3241659*PP**20190619*6275****CARB&#xd;
C3*USD&#xd;
G62*86*20190619&#xd;
N1*SH*CROW STAMPING&#xd;
N3*23331 CITY RD 3&#xd;
N4*REALTOWN*CA*56465&#xd;
N1*CN*AMERICAN MFG COMPANY&#xd;
N3*777 6TH AVE&#xd;
N4*SAN JOSE*CA*94008&#xd;
LX*1&#xd;
L5**KITCHEN TRASH&#xd;
L0**694*LB*694*G******L&#xd;
L1*1*72*CW*5000&#xd;
L7*1******50&#xd;
LX*2&#xd;
L5**FUE&#xd;
L1*2*0.255*FR*2125&#xd;
L3*194*N&#xd;
SE*20*0001&#xd;
GE*1*3507&#xd;
IEA*1*000003507</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8081</stringProp>
          <stringProp name="HTTPSampler.path">/x12/210</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Report Very small file: X12 2.5.1 50 Threads - 25 Request each " enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="3.0.0 HTTP POST X12 004010/210 Localhost Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">ISA*00*          *00*          *ZZ*MELERA         *ZZ*MULE           *190626*1830*U*00400*000003507*1*P*&gt;&#xd;
GS*IM*MELERA*MULE*20190626*1830*3507*X*004010&#xd;
ST*210*0001&#xd;
B3**12121231*ABC3241659*PP**20190619*6275****CARB&#xd;
C3*USD&#xd;
G62*86*20190619&#xd;
N1*SH*CROW STAMPING&#xd;
N3*23331 CITY RD 3&#xd;
N4*REALTOWN*CA*56465&#xd;
N1*CN*AMERICAN MFG COMPANY&#xd;
N3*777 6TH AVE&#xd;
N4*SAN JOSE*CA*94008&#xd;
LX*1&#xd;
L5**KITCHEN TRASH&#xd;
L0**694*LB*694*G******L&#xd;
L1*1*72*CW*5000&#xd;
L7*1******50&#xd;
LX*2&#xd;
L5**FUE&#xd;
L1*2*0.255*FR*2125&#xd;
L3*194*N&#xd;
SE*20*0001&#xd;
GE*1*3507&#xd;
IEA*1*000003507</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8081</stringProp>
          <stringProp name="HTTPSampler.path">/x12/210</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Report Very small file: X12 3.0.0 50 Threads - 25 Request each " enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>